% R = 10;
% input_points = [[-R, 0, 0]; [-R / 2.0, -R * sqrt(3) / 2.0, 0]; [R / 2.0, -R * sqrt(3) / 2.0, 1]];
% lengths = [15, 12, 11];

%! 注意这里我们输入点坐标已经经过了变换，输入次序为:y,z,x
input_points = [[1.0, 0.0, -1.7320499420166016]; [2.0, 0.0, 0.0]; [1.0, 0.0, 1.7320499420166016]];
% lengths = [1.9999992504097877, 1.4142135623730951, 1.9999992504097877];

% 测试新的位置？
% lengths = [2.018247872689567, 1.2928308075455672, 1.7624516711044231];

% 新的位置
% lengths = [2.3657317674384704, 2.0260857942972916, 2.3105336263665954];
%real result = [0.037257, 0.681303, 1.53775]

% 新的位置
lengths = [2.38584288, 1.86055479, 1.82380664];
%real result = [0.523799, 1.07976, 0.341499]
%ger answer = [0.5238    1.0798    0.3415]

%! 由于我们输入之前进行了变换，我们输出的点的次序变为了:(y,z,x)
out_points = solve_cable(input_points, lengths)